{
  "ending:godling_negotiated_cautious": {
	"title": "A Benevolent Guardian",
	"text": "Your cautious approach allowed you to negotiate. The godling’s power is now a part of you, but not its will. You are a new kind of deity, one that serves as a guardian rather than a conqueror. You have become a benevolent god."
  },
  "ending:godling_slain_cautious": {
	"title": "A Mortal Legend",
	"text": "Your morality allowed you to sever the connection, but at a cost. The godling’s essence is scattered, its power now your own. But you are forever changed, a mortal with a divine scar, and you have become a mortal legend."
  },
  "ending:godling_slain_bold": {
	"title": "A Predatory Tyrant",
	"text": "Your boldness allowed you to defeat the godling. Its power is now a part of you, but so is its predatory will. You are a conqueror, and your new godhood is based on conquest. You have become a predatory tyrant."
  },
  "ending:godling_dominated_bold": {
	"title": "A Tyrant",
	"text": "Your boldness allowed you to dominate the godling. It is now a slave to your will, and its power is your own. You have become an unstoppable force, a puppet master of the divine. You have become a tyrant."
  },
  "ending:godling_absorbed_dark": {
	"title": "The Ultimate Trickster",
	"text": "Your darkness allowed you to absorb the godling entirely. Its will is your own, and its power is your birthright. You are not a godling, you are the god, and the world is your toy. You have become the ultimate trickster."
  },
  "ending:godling_obliterated_dark": {
	"title": "The Lost God",
	"text": "Your darkness allowed you to obliterate the godling. But in doing so, you have lost all sense of self. Your mind is a vortex of chaotic energy, and you are lost forever in the shadows of what could have been. You have become the lost god."
  },
  "ending:predatory_cautious": {
	"title": "A Benevolent Predator",
	"text": "You chose to merge carefully, retaining your identity. You are a new kind of deity, one that serves as a guardian rather than a conqueror. But your caution has a cost, and your power will slowly consume you. You have become a benevolent predator."
  },
  "ending:trickster_cautious": {
	"title": "A Benevolent Trickster",
	"text": "You chose to merge carefully, retaining your identity. You are a new kind of deity, one that serves as a guardian rather than a conqueror. But your caution has a cost, and your power will slowly consume you. You have become a benevolent trickster."
  },
  "ending:predatory_bold": {
	"title": "A Predatory God",
	"text": "You chose to merge boldly, retaining your identity. You are a new kind of deity, one that serves as a conqueror rather than a guardian. But your boldness has a cost, and your power will slowly consume you. You have become a predatory god."
  },
  "ending:trickster_bold": {
	"title": "A Trickster God",
	"text": "You chose to merge boldly, retaining your identity. You are a new kind of deity, one that serves as a conqueror rather than a guardian. But your boldness has a cost, and your power will slowly consume you. You have become a trickster god."
  },
  "ending:predatory_dark": {
	"title": "The Ultimate Predator",
	"text": "Your darkness allowed you to merge with the godling entirely. Its will is your own, and its power is your birthright. You are not a godling, you are the god, and the world is your toy. You have become the ultimate predator."
  },
  "ending:trickster_dark": {
	"title": "The Ultimate Trickster",
	"text": "Your darkness allowed you to merge with the godling entirely. Its will is your own, and its power is your birthright. You are not a godling, you are the god, and the world is your toy. You have become the ultimate trickster."
  }
}
